"Volume" = "Volume"; 
"Drawbars" = "Drawbars"; 
"Percussion Level" = "Percussieniveau"; 
"Percussion Time" = "Percussietijd"; 
"Click" = "Klik"; 
"Distortion" = "Vervorming"; 
"Rotary Speaker" = "Roterende speaker"; 


